version = {'1', '1.1', '1.2', '1.3', '2.0', '2.1', '2.2', '2.3', '2.4', '2.5', '2.6', '3.0', '3.1', '3.2', '3.3', '3.4', '3.5', '3.6', '3.7', '3.8', '3.9', '3.10', '3.11', '3.12', '3.13', '3.16', '3.17', '3.18', '3.19', '4.0', '4.1', '4.2', '4.3', '4.4', '4.5'};
number = 1 : length(version);
lines_of_code = [150867, 160423, 259690, 284602, 632062, 649715, 1475674, 1553144, 2752286, 3322825, 4764146, 11914002, 12016103, 12201423, 12337967, 12509654, 12673918, 12895419, 13157359, 13333358, 13550908, 13768488, 14127197, 14387259, 14539764, 15252592, 15216496, 15303113, 15392244, 15525488, 15666295, 16354974, 16597163, 16782638, 16977804];
code_and_version_regress = regress(lines_of_code.', [number; ones(1,length(number))].');
y = number * code_and_version_regress(1) + code_and_version_regress(2);
plot(number, lines_of_code, '.', number, y);
xlabel('Версия ядра')
ylabel('Количество строк')
R = corrcoef(number,lines_of_code);
disp('Коэффициент корреляции: ');
disp(R(1,2));